assignments/a1.org
#+Title: Computer Science 3MI3 – 2020 assignment 1
#+Subtitle: A language of expressions
#+Author: Mark Armstrong
#+Date: September 21st, 2020
#+Description: Writing interpreters for simple expression languages.
#+Options: num:nil
#+SETUPFILE: ../org-html-themes/setup/theme-readtheorg-local.setup

* Introduction
:PROPERTIES:
:CUSTOM_ID: Introduction
:END:

This assignment asks you to construct interpreters
for a simple language of mathematical expressions.
To put it another way, you are asked to construct simple calculators.

We provide an informal description of the language below.
Your task is to then represent the terms of the language
in Scala and Prolog, using the languages' facilities for
representing such data.

* Boilerplate
:PROPERTIES:
:CUSTOM_ID: Boilerplate
:END:

:TODO: (It will be similar to the homework boilerplate.)

* Informal description of the expression language
:PROPERTIES:
:CUSTOM_ID: Informal-description-of-the-expression-language
:END:

The language consists of integer constants and seven /prefix/ operators.
- The unary operator ~const~ which operates on integers.
- The unary operators ~neg~ (negative) and ~abs~ (absolute value)
  which operate on expressions of this language.
- The binary operators ~plus~, ~times~, ~minus~ and ~exp~ (exponent)
  which operator on expressions of this language.

The fact that all the operators are prefix
means that this language does not admit ambiguity;
that is, even without using parentheses,
there is only one possible reading of a given expression.

** Example 1
:PROPERTIES:
:CUSTOM_ID: Example-1
:END:

As an example of a syntactically correct expression, consider
#+begin_src text
abs minus abs const 5 abs const 6
#+end_src
which, if we parenthesised the expression and dropped the ~const~'s, would read
#+begin_src text
(abs (minus (abs 5) (abs 6)))
#+end_src
or, in the usual notation,
#+begin_src latex
$|(|5| - |6|)|$
#+end_src

** Example 2
:PROPERTIES:
:CUSTOM_ID: Example-2
:END:

As an additional example, consider
#+begin_src text
plus plus plus exp const 1 const 2 exp const 2 const 2
    exp const 3 const 2 exp const 4 const 2
#+end_src
which, if we parenthesised the expression and dropped the ~const~'s, would read
#+begin_src text
(plus (plus (plus (exp 1 2) (exp 2 2)) (exp 3 2)) (exp 4 2))
#+end_src
or, in the usual notation,
#+begin_src latex
(((1² + 2²) + 3²) + 4²)
#+end_src

* Task 1 – Interpreter written in Scala  [20 marks]
:PROPERTIES:
:CUSTOM_ID: Task-1-–-Interpreter-written-in-Scala--[20 marks]
:END:

** 1.1 Representation [5 marks]
:PROPERTIES:
:CUSTOM_ID: 1.1-Representation-[5 marks]
:END:

Create a representation of the above described expressions
in Scala using the standard approach for algebraic datatypes,
and call this type ~Expr~.

Name your constructors after the operators,
of course capitalising the names.

So the expression
#+begin_src text
abs minus abs const 5 abs const 6
#+end_src
should be represented using your type as
#+begin_src amm
Abs(Minus(Abs(Const(5)), Abs(Const(6))))
#+end_src

** 1.2 Interpreter    [15 marks]
:PROPERTIES:
:CUSTOM_ID: 1.2-Interpreter----[15 marks]
:END:

Define a method ~interpretExpr~ acting on ~Expr~ which
calculates the value of an ~Expr~.

