assignments/a1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-27 Sun 15:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computer Science 3MI3 – 2020 assignment 1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="Writing interpreters for simple expression languages."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Computer Science 3MI3 – 2020 assignment 1
<br />
<span class="subtitle">A language of expressions</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">Introduction</a></li>
<li><a href="#Boilerplate">Boilerplate</a></li>
<li><a href="#Informal-description-of-the-expression-language">Informal description of the expression language</a>
<ul>
<li><a href="#Example-1">Example 1</a></li>
<li><a href="#Example-2">Example 2</a></li>
</ul>
</li>
<li><a href="#Task-1-–-Interpreter-written-in-Scala--[20 marks]">Task 1 – Interpreter written in Scala  [20 marks]</a>
<ul>
<li><a href="#1.1-Representation-[5 marks]">1.1 Representation [5 marks]</a></li>
<li><a href="#1.2-Interpreter----[15 marks]">1.2 Interpreter    [15 marks]</a></li>
</ul>
</li>
<li><a href="#Task-2-–-Interpreter-written-in-Prolog-[20 marks]">Task 2 – Interpreter written in Prolog [20 marks]</a>
<ul>
<li><a href="#1.1-Expression-recogniser-[5 marks]">1.1 Expression recogniser [5 marks]</a></li>
<li><a href="#org4dff41b">1.2 Interpreter           [15 marks]</a></li>
</ul>
</li>
<li><a href="#Task-3-–-Variables-and-substitution----[30 marks]">Task 3 – Variables and substitution    [30 marks]</a>
<ul>
<li><a href="#Task-3-description">Task 3 description</a></li>
<li><a href="#The-task-3">The task 3</a></li>
</ul>
</li>
<li><a href="#Task-4-–-Boolean-expressions-----------[30 marks]">Task 4 – Boolean expressions           [30 marks]</a>
<ul>
<li><a href="#Task-4-description">Task 4 description</a></li>
<li><a href="#The-task-4">The task 4</a></li>
</ul>
</li>
<li><a href="#Task-5-–-Bonus-------------------[10 bonus_marks]">Task 5 – Bonus: parsing                [10 bonus_marks]</a></li>
<li><a href="#Testing">Testing</a></li>
</ul>
</div>
</div>

<div id="outline-container-Introduction" class="outline-2">
<h2 id="Introduction">Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
This assignment asks you to construct interpreters
for a simple language of mathematical expressions.
To put it another way, you are asked to construct simple calculators.
</p>

<p>
We provide an informal description of the language below.
Your task is to then represent the terms of the language
in Scala and Prolog, using the languages' facilities for
representing such data.
</p>
</div>
</div>

<div id="outline-container-Boilerplate" class="outline-2">
<h2 id="Boilerplate">Boilerplate</h2>
<div class="outline-text-2" id="text-Boilerplate">
<p>
:TODO: (It will be similar to the homework boilerplate.)
</p>
</div>
</div>

<div id="outline-container-Informal-description-of-the-expression-language" class="outline-2">
<h2 id="Informal-description-of-the-expression-language">Informal description of the expression language</h2>
<div class="outline-text-2" id="text-Informal-description-of-the-expression-language">
<p>
The language consists of integer constants and seven <i>prefix</i> operators.
</p>
<ul class="org-ul">
<li>The unary operator <code>const</code> which operates on integers.</li>
<li>The unary operators <code>neg</code> (negative) and <code>abs</code> (absolute value)
which operate on expressions of this language.</li>
<li>The binary operators <code>plus</code>, <code>times</code>, <code>minus</code> and <code>exp</code> (exponent)
which operator on expressions of this language.</li>
</ul>

<p>
The fact that all the operators are prefix
means that this language does not admit ambiguity;
that is, even without using parentheses,
there is only one possible reading of a given expression.
</p>
</div>

<div id="outline-container-Example-1" class="outline-3">
<h3 id="Example-1">Example 1</h3>
<div class="outline-text-3" id="text-Example-1">
<p>
As an example of a syntactically correct expression, consider
</p>
<div class="org-src-container">
<pre class="src src-text">abs minus abs const 5 abs const 6
</pre>
</div>
<p>
which, if we parenthesised the expression and dropped the <code>const</code>'s, would read
</p>
<div class="org-src-container">
<pre class="src src-text"><span style="color: #00cd68;">(</span>abs <span style="color: #b6a0ff;">(</span>minus <span style="color: #6ae4b9;">(</span>abs 5<span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>abs 6<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
<p>
or, in the usual notation,
</p>
</div>
</div>

<div id="outline-container-Example-2" class="outline-3">
<h3 id="Example-2">Example 2</h3>
<div class="outline-text-3" id="text-Example-2">
<p>
As an additional example, consider
</p>
<div class="org-src-container">
<pre class="src src-text">plus plus plus exp const 1 const 2 exp const 2 const 2
    exp const 3 const 2 exp const 4 const 2
</pre>
</div>
<p>
which, if we parenthesised the expression and dropped the <code>const</code>'s, would read
</p>
<div class="org-src-container">
<pre class="src src-text"><span style="color: #00cd68;">(</span>plus <span style="color: #b6a0ff;">(</span>plus <span style="color: #6ae4b9;">(</span>plus <span style="color: #f0ce43;">(</span>exp 1 2<span style="color: #f0ce43;">)</span> <span style="color: #f0ce43;">(</span>exp 2 2<span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>exp 3 2<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span>exp 4 2<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
<p>
or, in the usual notation,
</p>
</div>
</div>
</div>

<div id="outline-container-Task-1-–-Interpreter-written-in-Scala--[20 marks]" class="outline-2">
<h2 id="Task-1-–-Interpreter-written-in-Scala--[20 marks]">Task 1 – Interpreter written in Scala  [20 marks]</h2>
<div class="outline-text-2" id="text-Task-1-–-Interpreter-written-in-Scala--[20 marks]">
</div>

<div id="outline-container-1.1-Representation-[5 marks]" class="outline-3">
<h3 id="1.1-Representation-[5 marks]">1.1 Representation [5 marks]</h3>
<div class="outline-text-3" id="text-1.1-Representation-[5 marks]">
<p>
Create a representation of the above described expressions
in Scala using the standard approach for algebraic datatypes,
and call this type <code>Expr</code>.
</p>

<p>
Name your constructors after the operators,
of course capitalising the names.
</p>

<p>
So the expression
</p>
<div class="org-src-container">
<pre class="src src-text">abs minus abs const 5 abs const 6
</pre>
</div>
<p>
should be represented using your type as
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #00bcff;">Abs</span><span style="color: #00cd68;">(</span><span style="color: #00bcff;">Minus</span><span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">Abs</span><span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">Const</span><span style="color: #f0ce43;">(</span><span style="color: #00bcff;">5</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span>, <span style="color: #00bcff;">Abs</span><span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">Const</span><span style="color: #f0ce43;">(</span><span style="color: #00bcff;">6</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-1.2-Interpreter----[15 marks]" class="outline-3">
<h3 id="1.2-Interpreter----[15 marks]">1.2 Interpreter    [15 marks]</h3>
<div class="outline-text-3" id="text-1.2-Interpreter----[15 marks]">
<p>
Define a method <code>interpretExpr</code> acting on <code>Expr</code> which
calculates the value of an <code>Expr</code>.
</p>
</div>
</div>
</div>
