assignments/a1.tex
% Created 2020-09-27 Sun 15:29
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{tabularx}
\usepackage{etoolbox}
\makeatletter
\def\dontdofcolorbox{\renewcommand\fcolorbox[4][]{##4}}
\AtBeginEnvironment{minted}{\dontdofcolorbox}
\makeatother
\usepackage[newfloat]{minted}
\author{Mark Armstrong}
\date{September 21st, 2020}
\title{Computer Science 3MI3 – 2020 assignment 1\\\medskip
\large A language of expressions}
\hypersetup{
   pdfauthor={Mark Armstrong},
   pdftitle={Computer Science 3MI3 – 2020 assignment 1},
   pdfkeywords={},
   pdfsubject={Writing interpreters for simple expression languages.},
   pdfcreator={Emacs 27.0.90 (Org mode 9.4)},
   pdflang={English},
   colorlinks,
   linkcolor=blue,
   citecolor=blue,
   urlcolor=blue
   }
\begin{document}

\maketitle
\tableofcontents


\section*{Introduction}
\label{sec:orgef95b85}
This assignment asks you to construct interpreters
for a simple language of mathematical expressions.
To put it another way, you are asked to construct simple calculators.

We provide an informal description of the language below.
Your task is to then represent the terms of the language
in Scala and Prolog, using the languages' facilities for
representing such data.

\section*{Boilerplate}
\label{sec:org37bd73e}
:TODO: (It will be similar to the homework boilerplate.)

\section*{Informal description of the expression language}
\label{sec:orgc5d611e}
The language consists of integer constants and seven \emph{prefix} operators.
\begin{itemize}
\item The unary operator \texttt{const} which operates on integers.
\item The unary operators \texttt{neg} (negative) and \texttt{abs} (absolute value)
which operate on expressions of this language.
\item The binary operators \texttt{plus}, \texttt{times}, \texttt{minus} and \texttt{exp} (exponent)
which operator on expressions of this language.
\end{itemize}

The fact that all the operators are prefix
means that this language does not admit ambiguity;
that is, even without using parentheses,
there is only one possible reading of a given expression.

\subsection*{Example 1}
\label{sec:org88b7eed}
As an example of a syntactically correct expression, consider
\begin{minted}[breaklines=true]{text}
abs minus abs const 5 abs const 6
\end{minted}
which, if we parenthesised the expression and dropped the \texttt{const}'s, would read
\begin{minted}[breaklines=true]{text}
(abs (minus (abs 5) (abs 6)))
\end{minted}
or, in the usual notation,
$|(|5| - |6|)|$

\subsection*{Example 2}
\label{sec:org1e7e2a5}
As an additional example, consider
\begin{minted}[breaklines=true]{text}
plus plus plus exp const 1 const 2 exp const 2 const 2
    exp const 3 const 2 exp const 4 const 2
\end{minted}
which, if we parenthesised the expression and dropped the \texttt{const}'s, would read
\begin{minted}[breaklines=true]{text}
(plus (plus (plus (exp 1 2) (exp 2 2)) (exp 3 2)) (exp 4 2))
\end{minted}
or, in the usual notation,
(((1² + 2²) + 3²) + 4²)

\section*{Task 1 – Interpreter written in Scala  [20 marks]}
\label{sec:orgda65bc2}
\subsection*{1.1 Representation [5 marks]}
\label{sec:org5a7c6b7}
Create a representation of the above described expressions
in Scala using the standard approach for algebraic datatypes,
and call this type \texttt{Expr}.

Name your constructors after the operators,
of course capitalising the names.

So the expression
\begin{minted}[breaklines=true]{text}
abs minus abs const 5 abs const 6
\end{minted}
should be represented using your type as
\begin{minted}[breaklines=true]{scala}
Abs(Minus(Abs(Const(5)), Abs(Const(6))))
\end{minted}

\subsection*{1.2 Interpreter    [15 marks]}
\label{sec:org0051e23}
Define a method \texttt{interpretExpr} acting on \texttt{Expr} which
calculates the value of an \texttt{Expr}.
