assignments/a1.org
* Task 2 – Interpreter written in Prolog [20 marks]
:PROPERTIES:
:CUSTOM_ID: Task-2-–-Interpreter-written-in-Prolog-[20 marks]
:END:

** 1.1 Expression recogniser [5 marks]
:PROPERTIES:
:CUSTOM_ID: 1.1-Expression-recogniser-[5 marks]
:END:

Define a predicate ~isExpr~ in Prolog which recognises
trees which represent the above defined expressions.

The labels on the trees should be the name of the operation
appended by ~E~ (in order to avoid any clash with builtin predicates
of the same name.)

So the expression
#+begin_src text
abs minus abs const 5 abs const 6
#+end_src
would be represented in Prolog as
#+begin_src prolog
absE(minusE(absE(constE(5)), absE(constE(6))))
#+end_src
and the query ~isExpr(absE(minusE(absE(constE(5)), absE(constE(6)))))~ would
result in the response ~true~.

** 1.2 Interpreter           [15 marks]

Define a binary predicate ~interpretExpr~ which
relates these expressions to their numerical values.

That is, querying ~interpret(e,X)~ should
receive the response ~X = n~ where ~n~ is
the integer value of the expression.

Do not concern yourself with the other direction;
that is, we are not expecting queries
of the form ~interpret(X,n)~ to result in an answer.
(If you can, “fail gracefully”,
i.e., either throw a more meaningful exception
or avoid an exception altogether
but this is not expected even as a bonus.)

* Task 3 – Variables and substitution    [30 marks]
:PROPERTIES:
:CUSTOM_ID: Task-3-–-Variables-and-substitution----[30 marks]
:END:

** Task 3 description
:PROPERTIES:
:CUSTOM_ID: Task-3-description
:END:

In this task, we wish to add variables to our expressions.

This can be done by adding a new operator ~var~ to our expressions,
which operates on symbols representing variable names
(prolog has atoms which can be used a symbols,
and Scala has a ~Symbol~ type. The reason why symbols
are a better candidate than strings will be discussed
when we discuss types.)

However, adding this operator introduces a problem
with our ~interpret~ method/predicate:
how do we interpret a variable when we don't know its value?

Our solution in this assignment is to
introduce a /substitution/ operator,
which takes three values:
1. an expression to perform the substitution on,
2. the variable to be substituted, and
3. the expression to substitute for the variable.

For instance,
#+begin_src text
subst var x x const 6
#+end_src
would be written, using our usual mathematical syntax, as
#+begin_src text
x[x ≔ 6]
#+end_src
It should interpet to just ~6~.

(An alternate solution,
instead of building variable substitution into the language,
is to add a /state/ argument to ~interpret~,
which maps variables to values.
We will use states in later assignments for this purpose.)

** The task 3
:PROPERTIES:
:CUSTOM_ID: The-task-3
:END:

In Scala, create a new algebraic datatype ~VarExpr~ and a new
interpretation method ~varInterpret~ in Scala ([15 marks].)
Your new constructors should be called ~Var~ and ~Subst~.
You should reuse your existing ~Expr~ type when defining ~VarExpr~,
by including a constructor ~Simple~ which takes a ~Expr~ argument.

In Prolog, create a new recognising predicate ~isVarExpr~ which
recognising valid expressions in this extended language,
with the new labels being the operator names given in the description,
and a new predicate ~varInterpret~ which relates
expressions to their interpreted value ([15 marks].)
(In Prolog, there is no need to use
a label for “simple” expressions like we use
the ~Simple~ constructor in Scala.)

#+begin_center
*Pay attention when implementing the interpretation of substitution!*
*Review the concept of variable binding,*
*and do not substitute instances of the variable name*
*which are bound elsewhere!*
#+end_center

* Task 4 – Boolean expressions           [30 marks]
:PROPERTIES:
:CUSTOM_ID: Task-4-–-Boolean-expressions-----------[30 marks]
:END:

