assignments/a1.html

<div id="outline-container-Task-2-–-Interpreter-written-in-Prolog-[20 marks]" class="outline-2">
<h2 id="Task-2-–-Interpreter-written-in-Prolog-[20 marks]">Task 2 – Interpreter written in Prolog [20 marks]</h2>
<div class="outline-text-2" id="text-Task-2-–-Interpreter-written-in-Prolog-[20 marks]">
</div>

<div id="outline-container-1.1-Expression-recogniser-[5 marks]" class="outline-3">
<h3 id="1.1-Expression-recogniser-[5 marks]">1.1 Expression recogniser [5 marks]</h3>
<div class="outline-text-3" id="text-1.1-Expression-recogniser-[5 marks]">
<p>
Define a predicate <code>isExpr</code> in Prolog which recognises
trees which represent the above defined expressions.
</p>

<p>
The labels on the trees should be the name of the operation
appended by <code>E</code> (in order to avoid any clash with builtin predicates
of the same name.)
</p>

<p>
So the expression
</p>
<div class="org-src-container">
<pre class="src src-text">abs minus abs const 5 abs const 6
</pre>
</div>
<p>
would be represented in Prolog as
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #feacd0;">absE</span>(minusE(absE(constE(5)), absE(constE(6))))
</pre>
</div>
<p>
and the query <code>isExpr(absE(minusE(absE(constE(5)), absE(constE(6)))))</code> would
result in the response <code>true</code>.
</p>
</div>
</div>

<div id="outline-container-org4dff41b" class="outline-3">
<h3 id="org4dff41b">1.2 Interpreter           [15 marks]</h3>
<div class="outline-text-3" id="text-org4dff41b">
<p>
Define a binary predicate <code>interpretExpr</code> which
relates these expressions to their numerical values.
</p>

<p>
That is, querying <code>interpret(e,X)</code> should
receive the response <code>X = n</code> where <code>n</code> is
the integer value of the expression.
</p>

<p>
Do not concern yourself with the other direction;
that is, we are not expecting queries
of the form <code>interpret(X,n)</code> to result in an answer.
(If you can, “fail gracefully”,
i.e., either throw a more meaningful exception
or avoid an exception altogether
but this is not expected even as a bonus.)
</p>
</div>
</div>
</div>

<div id="outline-container-Task-3-–-Variables-and-substitution----[30 marks]" class="outline-2">
<h2 id="Task-3-–-Variables-and-substitution----[30 marks]">Task 3 – Variables and substitution    [30 marks]</h2>
<div class="outline-text-2" id="text-Task-3-–-Variables-and-substitution----[30 marks]">
</div>

<div id="outline-container-Task-3-description" class="outline-3">
<h3 id="Task-3-description">Task 3 description</h3>
<div class="outline-text-3" id="text-Task-3-description">
<p>
In this task, we wish to add variables to our expressions.
</p>

<p>
This can be done by adding a new operator <code>var</code> to our expressions,
which operates on symbols representing variable names
(prolog has atoms which can be used a symbols,
and Scala has a <code>Symbol</code> type. The reason why symbols
are a better candidate than strings will be discussed
when we discuss types.)
</p>

<p>
However, adding this operator introduces a problem
with our <code>interpret</code> method/predicate:
how do we interpret a variable when we don't know its value?
</p>

<p>
Our solution in this assignment is to
introduce a <i>substitution</i> operator,
which takes three values:
</p>
<ol class="org-ol">
<li>an expression to perform the substitution on,</li>
<li>the variable to be substituted, and</li>
<li>the expression to substitute for the variable.</li>
</ol>

<p>
For instance,
</p>
<div class="org-src-container">
<pre class="src src-text">subst var x x const 6
</pre>
</div>
<p>
would be written, using our usual mathematical syntax, as
</p>
<div class="org-src-container">
<pre class="src src-text">x<span style="color: #00cd68;">[</span>x &#8788; 6<span style="color: #00cd68;">]</span>
</pre>
</div>
<p>
It should interpet to just <code>6</code>.
</p>

<p>
(An alternate solution,
instead of building variable substitution into the language,
is to add a <i>state</i> argument to <code>interpret</code>,
which maps variables to values.
We will use states in later assignments for this purpose.)
</p>
</div>
</div>

<div id="outline-container-The-task-3" class="outline-3">
<h3 id="The-task-3">The task 3</h3>
<div class="outline-text-3" id="text-The-task-3">
<p>
In Scala, create a new algebraic datatype <code>VarExpr</code> and a new
interpretation method <code>varInterpret</code> in Scala ([15 marks].)
Your new constructors should be called <code>Var</code> and <code>Subst</code>.
You should reuse your existing <code>Expr</code> type when defining <code>VarExpr</code>,
by including a constructor <code>Simple</code> which takes a <code>Expr</code> argument.
</p>

<p>
In Prolog, create a new recognising predicate <code>isVarExpr</code> which
recognising valid expressions in this extended language,
with the new labels being the operator names given in the description,
and a new predicate <code>varInterpret</code> which relates
expressions to their interpreted value ([15 marks].)
(In Prolog, there is no need to use
a label for “simple” expressions like we use
the <code>Simple</code> constructor in Scala.)
</p>

<div class="org-center">
<p>
<b>Pay attention when implementing the interpretation of substitution!</b>
<b>Review the concept of variable binding,</b>
<b>and do not substitute instances of the variable name</b>
<b>which are bound elsewhere!</b>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-Task-4-–-Boolean-expressions-----------[30 marks]" class="outline-2">
<h2 id="Task-4-–-Boolean-expressions-----------[30 marks]">Task 4 – Boolean expressions           [30 marks]</h2>
<div class="outline-text-2" id="text-Task-4-–-Boolean-expressions-----------[30 marks]">
</div>
