assignments/a1.tex

\section*{Task 2 – Interpreter written in Prolog [20 marks]}
\label{sec:orgf7d46aa}
\subsection*{1.1 Expression recogniser [5 marks]}
\label{sec:org24761f4}
Define a predicate \texttt{isExpr} in Prolog which recognises
trees which represent the above defined expressions.

The labels on the trees should be the name of the operation
appended by \texttt{E} (in order to avoid any clash with builtin predicates
of the same name.)

So the expression
\begin{minted}[breaklines=true]{text}
abs minus abs const 5 abs const 6
\end{minted}
would be represented in Prolog as
\begin{minted}[breaklines=true]{prolog}
absE(minusE(absE(constE(5)), absE(constE(6))))
\end{minted}
and the query \texttt{isExpr(absE(minusE(absE(constE(5)), absE(constE(6)))))} would
result in the response \texttt{true}.

\subsection*{1.2 Interpreter           [15 marks]}
\label{sec:org250da4d}

Define a binary predicate \texttt{interpretExpr} which
relates these expressions to their numerical values.

That is, querying \texttt{interpret(e,X)} should
receive the response \texttt{X = n} where \texttt{n} is
the integer value of the expression.

Do not concern yourself with the other direction;
that is, we are not expecting queries
of the form \texttt{interpret(X,n)} to result in an answer.
(If you can, “fail gracefully”,
i.e., either throw a more meaningful exception
or avoid an exception altogether
but this is not expected even as a bonus.)

\section*{Task 3 – Variables and substitution    [30 marks]}
\label{sec:orgec36fc7}
\subsection*{Task 3 description}
\label{sec:org06989a9}
In this task, we wish to add variables to our expressions.

This can be done by adding a new operator \texttt{var} to our expressions,
which operates on symbols representing variable names
(prolog has atoms which can be used a symbols,
and Scala has a \texttt{Symbol} type. The reason why symbols
are a better candidate than strings will be discussed
when we discuss types.)

However, adding this operator introduces a problem
with our \texttt{interpret} method/predicate:
how do we interpret a variable when we don't know its value?

Our solution in this assignment is to
introduce a \emph{substitution} operator,
which takes three values:
\begin{enumerate}
\item an expression to perform the substitution on,
\item the variable to be substituted, and
\item the expression to substitute for the variable.
\end{enumerate}

For instance,
\begin{minted}[breaklines=true]{text}
subst var x x const 6
\end{minted}
would be written, using our usual mathematical syntax, as
\begin{minted}[breaklines=true]{text}
x[x ≔ 6]
\end{minted}
It should interpet to just \texttt{6}.

(An alternate solution,
instead of building variable substitution into the language,
is to add a \emph{state} argument to \texttt{interpret},
which maps variables to values.
We will use states in later assignments for this purpose.)

\subsection*{The task 3}
\label{sec:org4f1336b}
In Scala, create a new algebraic datatype \texttt{VarExpr} and a new
interpretation method \texttt{varInterpret} in Scala ([15 marks].)
Your new constructors should be called \texttt{Var} and \texttt{Subst}.
You should reuse your existing \texttt{Expr} type when defining \texttt{VarExpr},
by including a constructor \texttt{Simple} which takes a \texttt{Expr} argument.

In Prolog, create a new recognising predicate \texttt{isVarExpr} which
recognising valid expressions in this extended language,
with the new labels being the operator names given in the description,
and a new predicate \texttt{varInterpret} which relates
expressions to their interpreted value ([15 marks].)
(In Prolog, there is no need to use
a label for “simple” expressions like we use
the \texttt{Simple} constructor in Scala.)

\begin{center}
\textbf{Pay attention when implementing the interpretation of substitution!}
\textbf{Review the concept of variable binding,}
\textbf{and do not substitute instances of the variable name}
\textbf{which are bound elsewhere!}
\end{center}

\section*{Task 4 – Boolean expressions           [30 marks]}
\label{sec:orgf538b4e}
