assignments/a1.org
** Task 4 description
:PROPERTIES:
:CUSTOM_ID: Task-4-description
:END:

In this task, we create an alternate extension to
our first language of expressions
(that is, we build on to ~Expr~, not ~VarExpr~.)

Our goal here is to add
a second /type/ of expressions to the language.
Namely, we are adding booleans.

The new operators are
the 0-ary ~tt~ and ~ff~ (0-ary meaning taking no arguments),
the unary ~bnot~ and the binary ~band~ and ~bor~.

For example, we have the new expression
#+begin_src text
bnot band tt bor ff tt
#+end_src
which in our usual notation would be written
#+begin_src text
¬ (true ∧ (false ∨ true))
#+end_src

These expressions cannot legally be allowed to mix
with integer expressions; that is,
trying to apply a integer operator to a boolean expression
or vice versa is not legal.

** The task 4
:PROPERTIES:
:CUSTOM_ID: The-task-4
:END:

In Scala, create a new algebraic datatype ~TypedExpr~ and a new
interpretation method ~typedInterpret~ in Scala ([15 marks].)
Your new constructors should be named ~TT~, ~FF~, ~Band~, ~Bor~ and ~Bnot~.
You should again reuse your existing ~Expr~ type when defining ~TypedExpr~,
by including a constructor ~IntExpr~ which takes a ~Expr~ argument.
Your interpreter should return an ~Option[Either[Int,Boolean]]~.
The ~Option~ type is used to handle failure in the case
of a “mixed” expression.
The ~Either~ type is used to handle two possible return types.

In Prolog, create a new recognising predicate ~isMixedExpr~ which
recognising valid expressions in this extended language,
with the new labels being the operator names given in the description,
and a new predicate ~mixedInterpret~ which relates
expressions to their interpreted value ([15 marks].)

* Task 5 – Bonus: parsing                [10 bonus_marks]
:PROPERTIES:
:CUSTOM_ID: Task-5-–-Bonus-------------------[10 bonus_marks]
:END:

Create a /parser/ for the first language of expressions
in this assignment, both in Scala and in Prolog
(partial marks for implementing it in just one language.)

A parser will take as argument a string such as
#+begin_src text
abs minus abs const 5 abs const 6
#+end_src
and return an ~Expr~ representing the expression in that string.

You will likely want to first define a /lexer/ for the language,
that converts a string to a list of lexemes
(to do this, you will need to represent lexemes somehow.)
Such a list is far easier to match over than a string.

* Testing
:PROPERTIES:
:CUSTOM_ID: Testing
:END:

:TODO: This will be posted ASAP.
