assignments/a1.html

<div id="outline-container-Task-4-description" class="outline-3">
<h3 id="Task-4-description">Task 4 description</h3>
<div class="outline-text-3" id="text-Task-4-description">
<p>
In this task, we create an alternate extension to
our first language of expressions
(that is, we build on to <code>Expr</code>, not <code>VarExpr</code>.)
</p>

<p>
Our goal here is to add
a second <i>type</i> of expressions to the language.
Namely, we are adding booleans.
</p>

<p>
The new operators are
the 0-ary <code>tt</code> and <code>ff</code> (0-ary meaning taking no arguments),
the unary <code>bnot</code> and the binary <code>band</code> and <code>bor</code>.
</p>

<p>
For example, we have the new expression
</p>
<div class="org-src-container">
<pre class="src src-text">bnot band tt bor ff tt
</pre>
</div>
<p>
which in our usual notation would be written
</p>
<div class="org-src-container">
<pre class="src src-text">&#172; <span style="color: #00cd68;">(</span>true &#8743; <span style="color: #b6a0ff;">(</span>false &#8744; true<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>

<p>
These expressions cannot legally be allowed to mix
with integer expressions; that is,
trying to apply a integer operator to a boolean expression
or vice versa is not legal.
</p>
</div>
</div>

<div id="outline-container-The-task-4" class="outline-3">
<h3 id="The-task-4">The task 4</h3>
<div class="outline-text-3" id="text-The-task-4">
<p>
In Scala, create a new algebraic datatype <code>TypedExpr</code> and a new
interpretation method <code>typedInterpret</code> in Scala ([15 marks].)
Your new constructors should be named <code>TT</code>, <code>FF</code>, <code>Band</code>, <code>Bor</code> and <code>Bnot</code>.
You should again reuse your existing <code>Expr</code> type when defining <code>TypedExpr</code>,
by including a constructor <code>IntExpr</code> which takes a <code>Expr</code> argument.
Your interpreter should return an <code>Option[Either[Int,Boolean]]</code>.
The <code>Option</code> type is used to handle failure in the case
of a “mixed” expression.
The <code>Either</code> type is used to handle two possible return types.
</p>

<p>
In Prolog, create a new recognising predicate <code>isMixedExpr</code> which
recognising valid expressions in this extended language,
with the new labels being the operator names given in the description,
and a new predicate <code>mixedInterpret</code> which relates
expressions to their interpreted value ([15 marks].)
</p>
</div>
</div>
</div>

<div id="outline-container-Task-5-–-Bonus-------------------[10 bonus_marks]" class="outline-2">
<h2 id="Task-5-–-Bonus-------------------[10 bonus_marks]">Task 5 – Bonus: parsing                [10 bonus_marks]</h2>
<div class="outline-text-2" id="text-Task-5-–-Bonus-------------------[10 bonus_marks]">
<p>
Create a <i>parser</i> for the first language of expressions
in this assignment, both in Scala and in Prolog
(partial marks for implementing it in just one language.)
</p>

<p>
A parser will take as argument a string such as
</p>
<div class="org-src-container">
<pre class="src src-text">abs minus abs const 5 abs const 6
</pre>
</div>
<p>
and return an <code>Expr</code> representing the expression in that string.
</p>

<p>
You will likely want to first define a <i>lexer</i> for the language,
that converts a string to a list of lexemes
(to do this, you will need to represent lexemes somehow.)
Such a list is far easier to match over than a string.
</p>
</div>
</div>

<div id="outline-container-Testing" class="outline-2">
<h2 id="Testing">Testing</h2>
<div class="outline-text-2" id="text-Testing">
<p>
:TODO: This will be posted ASAP.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: September 21st, 2020</p>
     <p class="date">Last updated: 2020-09-27 Sun 15:18</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.90 (<a href="https://orgmode.org">Org</a> mode 9.4)</p>
     <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
