assignments/a1.tex
\subsection*{Task 4 description}
\label{sec:org3594328}
In this task, we create an alternate extension to
our first language of expressions
(that is, we build on to \texttt{Expr}, not \texttt{VarExpr}.)

Our goal here is to add
a second \emph{type} of expressions to the language.
Namely, we are adding booleans.

The new operators are
the 0-ary \texttt{tt} and \texttt{ff} (0-ary meaning taking no arguments),
the unary \texttt{bnot} and the binary \texttt{band} and \texttt{bor}.

For example, we have the new expression
\begin{minted}[breaklines=true]{text}
bnot band tt bor ff tt
\end{minted}
which in our usual notation would be written
\begin{minted}[breaklines=true]{text}
¬ (true ∧ (false ∨ true))
\end{minted}

These expressions cannot legally be allowed to mix
with integer expressions; that is,
trying to apply a integer operator to a boolean expression
or vice versa is not legal.

\subsection*{The task 4}
\label{sec:orge50db25}
In Scala, create a new algebraic datatype \texttt{TypedExpr} and a new
interpretation method \texttt{typedInterpret} in Scala ([15 marks].)
Your new constructors should be named \texttt{TT}, \texttt{FF}, \texttt{Band}, \texttt{Bor} and \texttt{Bnot}.
You should again reuse your existing \texttt{Expr} type when defining \texttt{TypedExpr},
by including a constructor \texttt{IntExpr} which takes a \texttt{Expr} argument.
Your interpreter should return an \texttt{Option[Either[Int,Boolean]]}.
The \texttt{Option} type is used to handle failure in the case
of a “mixed” expression.
The \texttt{Either} type is used to handle two possible return types.

In Prolog, create a new recognising predicate \texttt{isMixedExpr} which
recognising valid expressions in this extended language,
with the new labels being the operator names given in the description,
and a new predicate \texttt{mixedInterpret} which relates
expressions to their interpreted value ([15 marks].)

\section*{Task 5 – Bonus: parsing                [10 bonus\_marks]}
\label{sec:orgb8f30ed}
Create a \emph{parser} for the first language of expressions
in this assignment, both in Scala and in Prolog
(partial marks for implementing it in just one language.)

A parser will take as argument a string such as
\begin{minted}[breaklines=true]{text}
abs minus abs const 5 abs const 6
\end{minted}
and return an \texttt{Expr} representing the expression in that string.

You will likely want to first define a \emph{lexer} for the language,
that converts a string to a list of lexemes
(to do this, you will need to represent lexemes somehow.)
Such a list is far easier to match over than a string.

\section*{Testing}
\label{sec:org8e80944}
:TODO: This will be posted ASAP.
\end{document}
